import random
import collections
import pandas as pd

def roll_of_the_dice(n):
    throws = []
    for _ in range(n):
        sum = random.randint(1, 6) + random.randint(1, 6)
        throws.append(sum)
    counter_throws = collections.Counter(throws)
    table = {"Сумма": [], "Імовірність": [] }

    for th, cou in counter_throws.items():
        table["Сумма"].append(th)
        table["Імовірність"].append(f"{(cou / n) * 100:.2f}%")

    df = pd.DataFrame(table)
    df.set_index('Сумма', inplace=True)
    sort_df = df.sort_index()

    return sort_df

print(roll_of_the_dice(100000))

# Імовірність випадіння на n-кількість кидків
#       На 100000      |        На 36          |  На 36 з таблиці із ДЗ
# Сумма   Імовірність  |  Сумма   Імовірність  |  Сумма   Імовірність       
# 2            2.79%   |   2           16.67%  |    2            2.78%
# 3            5.55%   |   3            5.56%  |    3            5.56%
# 4            8.26%   |   4           11.11%  |    4            8.33%
# 5           11.10%   |   5           16.67%  |    5           11.11%
# 6           13.95%   |   6           11.11%  |    6           13.89%
# 7           16.70%   |   7           13.89%  |    7           16.67%
# 8           13.89%   |   8            2.78%  |    8           13.89%
# 9           11.09%   |   9            5.56%  |    9           11.11%
# 10           8.24%   |   10           5.56%  |    10           8.33%
# 11           5.55%   |   11           8.33%  |    11           5.56%
# 12           2.87%   |   12           2.78%  |    12           2.78%
# 
# Як показує порівняння результатів симуляції методом Монте-Карло з аналітичними значеннями, при невеликій кількості кидків можливі значні відхилення ймовірностей випадіння сум. 
# Однак зі збільшенням кількості експериментів отримані результати поступово наближаються до теоретичного розподілу.

# Найчастіше випадає сума 7, дещо рідше — 6 та 8, ще рідше — 5 та 9, а найменшу ймовірність мають крайні значення 2 та 12. 
# Таким чином, симуляція підтвердила, що суми при киданні двох кубиків не є рівноймовірними, а отримані дані узгоджуються з математично обґрунтованим розподілом.